["Probably one of the hardest things for Pinocchio to pull off was complimenting his friend's experimental theater piece.","Damn shame some of ya'll will get on twitter to say Goodmorning before even brushing your teeth. #mustymouthtweet","Thanks to the internet I know the actual medical terms for all the ailments that I'm positive I'm dying from.","According to old paintings, there's mad titties in heaven.","My daughter may only be one year old today, but she retrieves beer from the fridge at a fourth grade level.","[the boss walks by my desk and catches me looking at sonic anime] Me: the hackers are at it again. I was trying to visit church. com","A bee was buzzing around my head and I was all \"It's not worth it, bro\" and he was all \"Fuck you, let's dance.\" Stung me and he's dead.","PISSED: teen gets fed up with teacher \"can i use the bathroom?\" \"i don't know, CAN you?\" *takes deep breath* *pisses all over teachers desk*","Is anyone going to tell America's Funniest Home Videos about youtube?","\"I have another terrible idea for a movie!\" - Tyler Perry, every morning.","The office supplier gave us some cheap toilet paper and now we've got a real mess on our hands.","caught my dog smoking weed so I sent her to military school","If Jesus really loved me he would have died and resurrected himself a few more times to give me some extra public holidays.","NCAA Hockey needs to re-name brackets. How is Alaska in the NE? They can see Russia.","is it \"milfs\" or \"milves\"?","\"This town ain't big enough for the two of us.\" -Someone who is terrible at English, science, and geography.","I an expert on everything as long as I have google within reach and I don't like you enough to want to prove you wrong.","I'm eating for 4: me, Beyoncé, and the twins.","shoutout to social anxiety but very quietly and while no one is looking","North Korean civilians have been playing the Hunger Games since the 1950s.","When you ask if I want fries or salad, I’ll pretend it’s a tough choice and we’ll enjoy a genial laugh before you bring me more ketchup.","My favorite kinds of people are sandwiches.","Happy birthday Bob Marley. Shirts with your face on it are now sold at Walmart.","When you're checking for murderers in your house, don't just yell out \"hello!\" that gives them the upper hand. Yell, \"YOU AINT SHIT!\"","My parents are pretty middle aged. \"So? That's pretty norm-\" *two knights bust in* \"CHILD, DOST THOU REQUEST REFRESHMENTS FROM THE TAVERN?\"","Our son eats 3 bowls of generic fruity pebbles every morning then pukes on the bus.","Surprised to learn that famed pornography company American Apparel has entered the clothing business.","\"It says here you're very sarcastic?\" Actually it says sadistic “why would you put that on a resume?” I was being sarcastic","what if it doesnt want to be called hot sauce???? what if it wants to be called beautiful sauce","Men who shave their arms and legs probably shave their vaginas as well."]
