["It must be Monday somewhere.","Go ahead, call the cops, lady. I got ten witnesses that'll say your baby kicked me first.","Hitler wasn't such a bad guy. After all, he did kill Hitler.","Oddly enough, when ducks take pictures of themselves, they make the drunk sorority girl face.","[Spider sits at computer and Googles probability of being eaten by human in his lifetime] Holy shit Sharon, COME SEE THIS","Shall I compare thee to a summer's day? You're hot but you make me really uncomfortable, sometimes my underwear gets sticky and I get burned","Dear YouTube: Please just assume that I'd like to \"skip ad\". You don't need to ask anymore.","Corn on the cob today is corn on the log tomorrow.","The average time it takes for an elderly woman to get her ringing cellphone out of her purse is 11 days.","\"OMG, I FORGOT TO CHECK FACEBOOK\" - somebody almost about to get some work done","The animosity between Republicans & Democrats is NOTHING compared to the hatred between Jeffs & Geoffs.","Going to Forest Whitaker's house, but I can't tell if it's the one on the right or the left.","It's 2018. The word \"nut\" now has at least four distinct meanings. We are living in a dystopia.","\"Can I have more of these mouse spears?\" \"Sir those are toothpicks\" \"I need 1000 for my army. We march at dawn\"","Holy crap! I forgot to have coffee today! What else did I forget? WHERE IS MY BABY?!? Wait, do I have one of those? DO I HAVE A BABY?!?","Remember alcohol is NEVER the answer. \"Why can't I get it up?\" Okay, sometimes alcohol is the answer.","And now the most difficult task known to man: Quickly boarding a plane, stowing your carry-on, and sitting the fuck down.","A good neighbor smiles and nods when they see you. A great neighbor goes inside when you come out.","Ate a hot dog at the food court today and four gay men gave me a standing ovation.","Which came first, the chicken, the egg, or the rooster's insistence that he knows what's best for both of their bodies?","Alright Ralphs, here's the deal: you replace people with automated cashiers, I replace paying with stealing produce.","We see you, people who order tea at coffee shops. We see you...","Most of life is waiting for whatever you're at to be over.","He was a good dog. He was a beautiful, very good dog. Who was a good dog? Who's a beautiful, good boy? Was it you? It was.—Dog obituary","I put my pants on like everybody else. Grudgingly.","I hope I'm never behind Johnny Depp going through airport security. Watching him take off all those accessories would be sad.","Life is basically one long, terrible date with yourself.","\"My fellow Americans, I have authorized action to degrade and destroy Adobe's ability to push updates to devices.\" [Cheering in streets]","So you guys heard about this MySpace thing?","Once I get tan this summer there's going to be literally only one thing that can stop me: simple carbohydrates","people always talk about how student athletes bring in tons of money and don’t get paid, yet no one talks about elementary schools selling $7 tickets to plays where the kids act for free. i killed it as king duncan in my 5th grade’s production of mac","This kid at my nephew's birthday party shit his pants and got to go home. I'm seriously considering this option.","If bars can say no to drunk people why won't McDonalds say no to fat people?","Any pizza at Pizza Hut is only $10. ANY! How is there still sadness in the world?","\"Please go to voicemail. Please go to voicemail. Please go to voicemail.\" - me making a phone call","I recently saved a ton of money on my car insurance. By fleeing the scene of the accident.","all your favs are going to a special cause tonight it's called \"my low self esteem\"","\"Guys. You guys. GUYS. Guys. YOU GUYS. Guys. Guys. GUYS.\" - guy who discovered ice cream","my dad and i both insisted our twitter handles be put in my grandma’s funeral program in 2015 and netted zero (0) followers","free toilet paper samples at sams club today. everyones wiping their slopped up holes in the middle of the aisle. its disgusting","\"I bet you I can get people to buy the shirt from a game they don't even know how to play.\" -Ralph Lauren","The only thing that would make my morning more productive is actually doing something.","Happy penis to Sigmund Freud. What? No, I'm pretty sure I said \"birthday.\"","Do not email me when my bill is ready, email me when someone has paid it, thank u.","Need special medicine for our son’s kidneys but we can’t afford it because we bought printer ink last week :(","I just saw a picture of a duck posing and doing a dumbwhitegirlface.","I just robbed everyone at a Whole Foods Market, armed with nothing but a bag of gluten.","My NY friends complain I never have to shovel in LA. Yeah? You think these heaps of broken dreams will get off the sidewalk themselves?","PARTYING = a simple word describing the physical expression of a state mind in which you're deeply aware of how incredible it is to exist.","@realDonaldTrump the 1930s called, they said \"great idea.\"","Listen Target, I always try products before I buy them and if that means dry humping the shit out of your body pillows in aisle 9, so be it.","Sometimes I hang out in tea shops waiting for someone to say \"Oolong\" so I can shout \"THAT'S WHAT SHE SAID!\"","The most unrealistic movies aren't fantasy and sci-fi. They're the movies where people have a conversation in the pouring rain.","Tom should concentrate less on Myspace and more on his shoe business","For every 10,000 references to incest in the GOT books George RR Martin gets to add another R to his name. (He was born Geoge Matin.)","A majority of my fortune will be spent accurately recreating the obstacle courses of Nickelodeon shows from my childhood.","\"You can't tell me what to do!\" I screamed, and ate the packet of silica gel.","[narrating people dancing at a wedding] These humans are using their legs for the first time today","free toilet paper samples at sams club today. everyones wiping their slopped up holes in the middle of the aisle. its disgusting","There should be a second 'The Ugly Duckling' written Benjamin Button-style for all the cute kids that turn out ugly.","Just saw the hood of my jacket out of the corner of my eye and jumped out of the way, in case the Navy SEALS are hiring.","I like my women like I like my Pistachio nuts. Easy to get inside or else I'll just move onto the next. Ha ha only joking. I'm so lonely.","Can someone go to the gym and work out for me? I’m trying to finish this pint of ice cream. Thanks","Joint Facebook accounts are the couples sitting on the same side of the booth of the internet.","This is embarrassing but I just noticed that I've been wearing \"2006\" New Year's Eve glasses for the past decade. :(","The worst thing about being single is wondering if I'll ever have kids. Like, what if I just keep making money & having fun forever? Scary!","When I was child we had to look things up in dictionary or encyclopedia, uphill both ways in the snow","If you get pulled over for speeding on the highway, police are legally required to let you go if you tell them 'Black Betty' was playing.","Hi, I'm Captain Morgan and this is my uptight brother, J.P.","I'd attend church a lot more if, instead of a tiny cracker, the body of Christ was a tiny quesadilla.","My enthusiasm knows bounds.","Just cause something is your middle name doesn't mean you do it all the time. My middle name is sexhaver. Lol ok, bad example, but","If Yo Yo Ma doesn't answer the phone by saying \"cello\" then I consider his entire life a failure.","I just realized that I get most of my news from Twitter. So... someone remind me what Pres Bieber's health care bill will do to your mom?","I could solve the energy crisis if there was a way to harness the power of how precisely wrong the airport security line I always pick is.","It's like Maury doesn't even care who the real father of my kitten is.","Why are Sharks the only species that get their own week? I'd totally watch hermit crab week if they had one.","Babies are like Polaroid pictures. They develop quicker when you shake them.","Don't ask me where I've been all your life if you're going to look so bored when I open my diary and give you a comprehensive answer.","I can tell how productive I was at work by how much battery my cell phone has left when I leave.","Uh oh. My car's GPS asked me, \"Who's Siri?\"","If we repeal the 14th amendment, does that means there's room for another 2nd amendment? Same as the old one, but this time in all caps.","[God creating hairless cats] How about some foreskin with night vision.","Canada's four seasons: almost winter, winter, still winter, and road construction.","I like when websites ask \"HOW DID YOU HEAR ABOUT US?\" Haha paranoid much?","Men do not have multiple orgasms like women do because if they did they would never be able to get out of the fucking shower.","white people loooooove watching other white people try and park in a difficult spot","After months of practice, I can finally touch my toes. (By telling them that they are beautiful.)","My facial tattoo is going to look so cool when I'm working as a janitor for McDonalds.","Somewhere there's a DJ Tanner spinning to a full house and that's what keeps me going you guys.","\"I invented the cubicle.\" - Someone hopefully in Hell","Holy lord, that sneeze felt so good I feel like I just cheated. I even named it Stan to further delude myself. I'm such a bad girl!","Notice how \"me\" comes first in merge? There's a reason for that.","what % of the time are birds just chilling","Just looked at the bottom of this can of whoopass. It's expired.","Corn Nuts is the name of a delicious snack treat. And a horrible medical condition.","If we stop neutering our dogs then the Terriers have won.","I'm human, but I never got to go to space. Dogs and monkeys *aren't human, but they did. That's the gist of my lawsuit against NASA.","Pro tip: most pro tips are given by amateurs.","It takes me about 25 minutes to pack a suitcase, but I still always block out 4 hours for it."]
