["I would just like to make clear that I WAS offered a presidential medal of freedom for “doing good tweets” but have respectfully declined","My life is boring, I'm a shitty photographer and I don't know how to write. So anyway, what should I call my blog?","I haven't used the computer in my basement since 1994 because the topless jpg. of Pamela Anderson is still downloading.","When you hold me, I'd prefer it not be \"accountable.\"","I went to a Mechanic when my car started making these awful noises but it just turned out to be Nickelback playing on the radio.","*becomes suddenly aware of the overwhelming amount of beauty and horror in the world and the brief second in time we exist on it* what the","I just remembered the fuck outta The Alamo.","I've never seen a dead body but I did once watch a girl get proposed to in an Applebee's","let us remember today the most important immigrant refugee in all of history. that's right i'm talking about waldo from where's waldo","The coolest thing about being a dog must be the ability to use your own ass for a pillow.","NYPD officers accidentally shot two tourists in Times Square, but in the cop’s defense, the tourists were about to eat at Olive Garden","Let them know how much you care. This holiday season, say it with a mass text.","Girls aren't friends with other girls. They are just future enemies.","God loves me even when I don't forward those chain letters","A fun thing to do when you're done dating someone is just disappear completely and pretend you've lost your phone and died","Friday Fun Fact: There's more time spent installing Adobe updates than the actual use of Adobe.","It's amazing that even 20 years later, pretending to shoot heroin with an mechanical pencil can still be a great way to procrastinate.","If I could go back to my childhood with the knowledge I have today, I'd probably earn the nickname 'little pervert'.","Whenever I hear an uninteresting 80 year old woman tell an uninteresting story I think, \"Wow, you must have been really hot.\"","I'm a hard core Trekkie except instead of Star Trek, alcohol.","HOLY SHIT I JUST CORRECTLY GUESSED A WIFI PASSWORD AM I JESUS?","Another Sunday at Gym Church w/ Pastor Pumpz. We sang \"My Bod is an Awesome Bod\", \"Bod is Great Bod is Good\", and \"Be Thou My Protein\"","Holy shit, FREE BANANAS at Walmart if you walk around eating them while you shop!","29 months? Yeah, no, I meant how old is your kid in HOURS.","my life is all about getting strong and powerful and then marching on down to hell to challenge satan for the throne","If at first you don't succeed tell yourself a litany of excuses then numb yourself with Oreo blizzards.","\"There's nothing more beautiful than the birth of a child.\" (someone who's never seen the birth of a child)","Kudos to therapists for resisting the natural urge to top other people's problems.","Commandment XI: There Shall Be No Boner Sound Other Than “Boioioioioioing”","my fitness goal is just to get down to the weight that i lied about on my drivers license","\"This is NPR.\" Yeah, we know. You just spent the past 4 minutes whispering the news over a jazz saxophone solo.","Walked in on the big pillow in bed with my favorite blanket. Feel so betrayed.","If you want something to be misinterpreted, post it on the Internet.","hey sory i just saw this mesage u sent last month even tho all my notifications make sounds and my phone is in my hand even when im sleeping","\"Nope. Nope. Yeah right. Nope. Close! Nah. Nope. Almost! Hahaha, you're terrible at this.\" - piece of popcorn stuck between teeth.","Smelling one of my farts has to kill at least 10 million brain cells. My dog doesn't even know how to bark anymore.","I was fired from my job at the sperm bank for saying \"get a load of this guy\" every time someone walked in","Every cab ride for me is 75% fake laughter.","new hipster fad = being really into public domain music","<-- Spends a good 10 minutes removing the stuffed animals from my bed before we get down to business. But Rupert stays, he likes to watch.","I love restaurants that have signs like \"Since 1916\". It's a great way to know the place you're eating at was probably super racist.","The human body can survive 28 days without food, but only 11 minutes without Internet.","Instead of the standard 140, people should only be allowed as many characters as they have IQ points.","\"Give me your Vitamin Water and your organic gluten-free cookies unless there's peanuts in them because I'm allergic.\" - 2012 school bully","It's so weird and coincidental that everyone who likes me is cool and smart and everyone who doesn't is an egomaniacal asshole.","one time a girl asked for my number and i got so nervous that i accidentally gave her my social security number","Now taking pre-orders for my \"Running after the Ice Cream Truck\" fitness workout DVD.","There are few things in life as pure and true as a grilled cheese sandwich.","I'd get a lot more sleep if I didn't insist on reading the entire internet every night.","I actually talked to real people this weekend. It was weird.","Hey. Cursive letter 'Q.' Nope.","I love how you can tell how slutty a girl is by the size of her hoop earrings.","When Jedi need to read PDFs, they use Adobe Wan Kenobi.","I never know what to do in these situations. Do I shake the boyfriend's hand or kiss her cheek to show how much I appreciate her ass?","A good coffee table book would be photos of U.S. Presidents' orgasm faces.","Look, lady, you can either be disappointed that I have an average penis, or excited that I have a GIGANTIC micropenis.","I thought about being a feminist but what could I possibly do for the cause? I'm just a woman.","Someone just caught me picking my nose at a stop light. Had to just cut my losses and run the red light.","A new BBC documentary accuses Hitler of millions of dollars worth of tax evasion. Man, the more I learn about this guy, the less I like him!","If I could time travel, I'd make sure the guy who made up the word Walkie-Talkie got to name more things.","Hey guys, remember that one time, when Clinton was president and gas was a like a $1 a gallon and people had money and jobs and shit?","I only learned Roman numerals so I can be damn sure which Rocky I'm about to watch.","If a girl elongates her words when she's texting me, I know she's down to fuckkkk, developmentally disabled, or bothhhhh.","Leaving church just now, the priest shakes my hand and says \"Love your neighbor\" I said \"Me too Father, she's got some tits, huh!??\"","We need to be more concerned about dinosaur ghosts","Santa got stuck in the chimney. So I grabbed the nearest lube & rubbed him down. Then he REALLY came down the chimney!!","\"A computer keyboard has more bacteria than a toilet seat.\" I don't doubt it, given the shit my boss sends us in email.","\"Toothpaste? You made that word up!\" - Steve Bushemi","If science is so great why hasn't it invented chocolate that has negative calories?","Probably the worst & the best thing about having King Kong go crazy in your town would be the huge, monster genitalia.","If your a kid and want to become cooler, heres a tip. Start smoking cigarette's. You can thank me later.","Killing someone with kindness sounds like a lot of work to me.","My orgasm face is pretty much the same as my looking-over-my-shoulder-while-backing-up-the-car face.","One of the cooler things you can do when you die is be buried with an elephant bone, just to confuse future archaeologists.","Ya know who's probably more bummed out than any of us? Bums.","It's been so long since I bought groceries, this morning I saw a cockroach move out. \"Good luck,\" he sighed, clutching his tiny suitcases.","I fall and drown in the lake. They pull out my body. \"It's so bloated and grotesque\" says one. \"He only fell in a minute ago\" says another","Food Fact: Pringles™ are actually shavings from the Allpringle™, which resides in the center of the Earth","No bees were harmed in the making of my new short film, \"Bees on Fire: Screams from Inside a Hive\".","There's a fine science to the number of texts you need to pretend to be friendly before asking someone for a favor.","My legal team is advising me to get jiggy with it.","\"do you know why i pulled you ov.. are you.. pinocchio?\" yea, so what \"is that a hooker?\" uh.. nope, no *his nose hits the fuckin moon*","If the free sample lady at the grocery store isn't handing out something I want I don't even acknowledge her as a human being.","There's no \"creative\" way to arrange 29 sponsor logos. Let it go, walkathon t-shirt designer.","Thanks for the free womb & board, Mom! Happy Mother's Day.","Dear Car Companies, Please replace glove compartments with toaster ovens.","Saw some Advil on the floor this morning and sincerely thought \"Better just leave it there so I know where it is.\"","Uh oh, someone is heading this way and it looks like they want to talk to me *flops to the ground like a toy in Toy Story*","I keep a No. 2 pencil in my pocket just in case motherfuckers wanna test me.","\"I enjoy working with a hammer, but I don't want a blue collar job.\" - Everyone who eventually becomes a judge.","[on a speed date] USUALLY I PREFER COCAINE BUT WOW","It was the best of times, it was the worst of times. It was the S'mores of Pop-Tarts, it was the Unfrosted Strawberry of Pop-Tarts.","My dad once said 'why are hemorrhoids called hemorrhoids and asteroids called asteroids and not the other way around?' I still laugh...","My performance as \"guy who acts disgusted when wife says our recently divorced neighbor is dating a 23 year old\" is getting early Emmy buzz.","On the way into work I dropped my doughnut on the sidewalk. You read about these things, but never think it'll happen to you.","23 Mind-Blowing Ways You'll Never Get Back the Time Spent Reading This List","[fixing your car stereo] Ah here's the problem [ejects Pitbull CD]","I like to finish everyone's drinks at parties and then call them out for being drunks.","Chrysler is recalling over 24,000 vehicles due to unexpected brake failure that could put many unsatisfied customers out of their misery.","If I find myself at Paula Deen's house, I'll be sure to stay out of the kitchen. There's an oven in there. Jews in Stews #paulasbestdishes","Pretty sure you can see me practicing my \"not all Muslims are bad\" Thanksgiving talking points in the bg of a student film in Wash Sq Park."]
