["Santa got stuck in the chimney. So I grabbed the nearest lube & rubbed him down. Then he REALLY came down the chimney!!","\"A computer keyboard has more bacteria than a toilet seat.\" I don't doubt it, given the shit my boss sends us in email.","\"Toothpaste? You made that word up!\" - Steve Bushemi","If science is so great why hasn't it invented chocolate that has negative calories?","Probably the worst & the best thing about having King Kong go crazy in your town would be the huge, monster genitalia.","If your a kid and want to become cooler, heres a tip. Start smoking cigarette's. You can thank me later.","Killing someone with kindness sounds like a lot of work to me.","My orgasm face is pretty much the same as my looking-over-my-shoulder-while-backing-up-the-car face.","One of the cooler things you can do when you die is be buried with an elephant bone, just to confuse future archaeologists.","Ya know who's probably more bummed out than any of us? Bums.","It's been so long since I bought groceries, this morning I saw a cockroach move out. \"Good luck,\" he sighed, clutching his tiny suitcases.","I fall and drown in the lake. They pull out my body. \"It's so bloated and grotesque\" says one. \"He only fell in a minute ago\" says another","Food Fact: Pringles™ are actually shavings from the Allpringle™, which resides in the center of the Earth","No bees were harmed in the making of my new short film, \"Bees on Fire: Screams from Inside a Hive\".","There's a fine science to the number of texts you need to pretend to be friendly before asking someone for a favor.","My legal team is advising me to get jiggy with it.","\"do you know why i pulled you ov.. are you.. pinocchio?\" yea, so what \"is that a hooker?\" uh.. nope, no *his nose hits the fuckin moon*","If the free sample lady at the grocery store isn't handing out something I want I don't even acknowledge her as a human being.","There's no \"creative\" way to arrange 29 sponsor logos. Let it go, walkathon t-shirt designer.","Thanks for the free womb & board, Mom! Happy Mother's Day.","Dear Car Companies, Please replace glove compartments with toaster ovens.","Saw some Advil on the floor this morning and sincerely thought \"Better just leave it there so I know where it is.\"","Uh oh, someone is heading this way and it looks like they want to talk to me *flops to the ground like a toy in Toy Story*","I keep a No. 2 pencil in my pocket just in case motherfuckers wanna test me.","\"I enjoy working with a hammer, but I don't want a blue collar job.\" - Everyone who eventually becomes a judge.","[on a speed date] USUALLY I PREFER COCAINE BUT WOW","It was the best of times, it was the worst of times. It was the S'mores of Pop-Tarts, it was the Unfrosted Strawberry of Pop-Tarts.","My dad once said 'why are hemorrhoids called hemorrhoids and asteroids called asteroids and not the other way around?' I still laugh...","My performance as \"guy who acts disgusted when wife says our recently divorced neighbor is dating a 23 year old\" is getting early Emmy buzz.","On the way into work I dropped my doughnut on the sidewalk. You read about these things, but never think it'll happen to you.","23 Mind-Blowing Ways You'll Never Get Back the Time Spent Reading This List","[fixing your car stereo] Ah here's the problem [ejects Pitbull CD]","I like to finish everyone's drinks at parties and then call them out for being drunks.","Chrysler is recalling over 24,000 vehicles due to unexpected brake failure that could put many unsatisfied customers out of their misery.","If I find myself at Paula Deen's house, I'll be sure to stay out of the kitchen. There's an oven in there. Jews in Stews #paulasbestdishes","Pretty sure you can see me practicing my \"not all Muslims are bad\" Thanksgiving talking points in the bg of a student film in Wash Sq Park.","We cut open the cake at the gender reveal party and out spill thousands of fire ants. The guests howl. FIRE ANTS ARE MOSTLY MALE, I explain","When you ask if I want fries or salad, I’ll pretend it’s a tough choice and we’ll enjoy a genial laugh before you bring me more ketchup.","Hey, Johns, your parents thought about your name for about half a second.","Billions of years from now, Star Jones will expand and collapse in a brilliant explosion of cosmic matter and become Black Hole Jones.","You kick one baby and everyone's like \"That's not a football\" and \"He's not breathing, call 911.\" Draaaaaama.","I'm on a pepperoni pizza cleanse.","The truth about 9/11: it equals 0.81818182","\"I'm smart. Everyone else is stupid\" - everyone","The most awkward part of meeting new people is when my kids say, \"Please help us.\"","If I knew then what I know now, I would have been a really creepy, sexually frustrated toddler.","I'm on this new diet where I can eat anything but sugar, bread, meat, fruit, and food","This tweet was going to be really funny but I didn't write it down because I was totally sure I'd remember it.","I always sleep with a bed under my pillow, just in case","Behind every entitled shit-head kid is a parent who cuts the crusts off their sandwiches.","It must be Monday somewhere.","Go ahead, call the cops, lady. I got ten witnesses that'll say your baby kicked me first.","Hitler wasn't such a bad guy. After all, he did kill Hitler.","Oddly enough, when ducks take pictures of themselves, they make the drunk sorority girl face.","[Spider sits at computer and Googles probability of being eaten by human in his lifetime] Holy shit Sharon, COME SEE THIS","Shall I compare thee to a summer's day? You're hot but you make me really uncomfortable, sometimes my underwear gets sticky and I get burned","Dear YouTube: Please just assume that I'd like to \"skip ad\". You don't need to ask anymore.","Corn on the cob today is corn on the log tomorrow.","The average time it takes for an elderly woman to get her ringing cellphone out of her purse is 11 days.","\"OMG, I FORGOT TO CHECK FACEBOOK\" - somebody almost about to get some work done","The animosity between Republicans & Democrats is NOTHING compared to the hatred between Jeffs & Geoffs.","Going to Forest Whitaker's house, but I can't tell if it's the one on the right or the left.","It's 2018. The word \"nut\" now has at least four distinct meanings. We are living in a dystopia.","\"Can I have more of these mouse spears?\" \"Sir those are toothpicks\" \"I need 1000 for my army. We march at dawn\"","Holy crap! I forgot to have coffee today! What else did I forget? WHERE IS MY BABY?!? Wait, do I have one of those? DO I HAVE A BABY?!?","Remember alcohol is NEVER the answer. \"Why can't I get it up?\" Okay, sometimes alcohol is the answer.","And now the most difficult task known to man: Quickly boarding a plane, stowing your carry-on, and sitting the fuck down.","A good neighbor smiles and nods when they see you. A great neighbor goes inside when you come out.","Ate a hot dog at the food court today and four gay men gave me a standing ovation.","Which came first, the chicken, the egg, or the rooster's insistence that he knows what's best for both of their bodies?","Alright Ralphs, here's the deal: you replace people with automated cashiers, I replace paying with stealing produce.","We see you, people who order tea at coffee shops. We see you...","Most of life is waiting for whatever you're at to be over.","He was a good dog. He was a beautiful, very good dog. Who was a good dog? Who's a beautiful, good boy? Was it you? It was.—Dog obituary","I put my pants on like everybody else. Grudgingly.","I hope I'm never behind Johnny Depp going through airport security. Watching him take off all those accessories would be sad.","Life is basically one long, terrible date with yourself.","\"My fellow Americans, I have authorized action to degrade and destroy Adobe's ability to push updates to devices.\" [Cheering in streets]","So you guys heard about this MySpace thing?","Once I get tan this summer there's going to be literally only one thing that can stop me: simple carbohydrates","people always talk about how student athletes bring in tons of money and don’t get paid, yet no one talks about elementary schools selling $7 tickets to plays where the kids act for free. i killed it as king duncan in my 5th grade’s production of mac","This kid at my nephew's birthday party shit his pants and got to go home. I'm seriously considering this option.","If bars can say no to drunk people why won't McDonalds say no to fat people?","Any pizza at Pizza Hut is only $10. ANY! How is there still sadness in the world?","\"Please go to voicemail. Please go to voicemail. Please go to voicemail.\" - me making a phone call","I recently saved a ton of money on my car insurance. By fleeing the scene of the accident.","all your favs are going to a special cause tonight it's called \"my low self esteem\"","\"Guys. You guys. GUYS. Guys. YOU GUYS. Guys. Guys. GUYS.\" - guy who discovered ice cream","my dad and i both insisted our twitter handles be put in my grandma’s funeral program in 2015 and netted zero (0) followers","free toilet paper samples at sams club today. everyones wiping their slopped up holes in the middle of the aisle. its disgusting","\"I bet you I can get people to buy the shirt from a game they don't even know how to play.\" -Ralph Lauren","The only thing that would make my morning more productive is actually doing something.","Happy penis to Sigmund Freud. What? No, I'm pretty sure I said \"birthday.\"","Do not email me when my bill is ready, email me when someone has paid it, thank u.","Need special medicine for our son’s kidneys but we can’t afford it because we bought printer ink last week :(","I just saw a picture of a duck posing and doing a dumbwhitegirlface.","I just robbed everyone at a Whole Foods Market, armed with nothing but a bag of gluten.","My NY friends complain I never have to shovel in LA. Yeah? You think these heaps of broken dreams will get off the sidewalk themselves?","PARTYING = a simple word describing the physical expression of a state mind in which you're deeply aware of how incredible it is to exist.","@realDonaldTrump the 1930s called, they said \"great idea.\"","Listen Target, I always try products before I buy them and if that means dry humping the shit out of your body pillows in aisle 9, so be it.","Sometimes I hang out in tea shops waiting for someone to say \"Oolong\" so I can shout \"THAT'S WHAT SHE SAID!\""]
