["It would suck to look like William H. Macy but not be William H. Macy.","I was asked to leave the PTA because they don't consider what I do parenting.","Please don't tell my three year old his oversized black calculator isn't really an iPad. He'd be crushed to learn his dad lied to him.","\"I'm here for the orgy?\" - Things you shouldn't say when walking into a work meeting.","This girl on Facebook is dying her hair blonde tonight. Omg she's nervous, you guys.","I guess now we'll never know if they were identical or fraternal twin towers :(","A \"gag gift\" means something completely different to people into BDSM.","\"I don't follow her so whatever you do, don't LIKE one of her Instagram photos or she'll know we're looking at them.\" -Why 2015 is confusing","My boyfriend doesn't believe in labels, which is probably why he drank all that bleach","My Mom is a great travel agent if you're looking to take a Guilt Trip down Memory Lane.","I got a resume from a kid with the last name \"Arriola\". I'm bringing him in for an interview solely to make nipple jokes.","You never hear about a new ghost. \"Oh yeah, this place is haunted since Jeff died last Tuesday.\"","When are we going to change \"til death do us part\" to \"for the next five years\" ?","i wish u could kill cops in mario kart","If I fave ur tweet on a Friday night pls know I'm doing it from the party club, where I am partyclubbing with my [opens dictionary] friends","Pac-Man is a good metaphor for life because the goal is to eat all the pellets in a level. There is also fruit & ghosts, just like in life","Hi welcome to Hollister, would you like a flashlight?","hey magic 8 ball, why cant humans fly \"thats not a yes or no question\" then how did you just say that \"Yes\" no come on ju- \"Ask Again Later\"","When I don't approve of another shopper's groceries in the checkout line, I just use one of those separator bars to sweep them to the floor","OUT OF ALL THE BIKES ON THIS BIKE RACK, THIS ONE'S SEAT DEFINITELY SMELLS THE WORST.","\"Is that your dog?\" \"No, actually she's adopted... we were unable to conceive a dog naturally ourselves\"","\"Luke, I have no idea who your father is.\" #AlternateUniverseFilms","I can't use public toilets for fear of spending hours trying to break into each toilet roll holder to turn the paper around the \"right\" way.","Telemarketer: Are you a homeowner? Me: How big are your lips? Telemarketer: .... Me: Your lips. Are they huge? *click*","If a guy wants to call a woman ugly online a window should pop up where he has to upload pictures of all the women he's slept with","I would just like to make clear that I WAS offered a presidential medal of freedom for “doing good tweets” but have respectfully declined","My life is boring, I'm a shitty photographer and I don't know how to write. So anyway, what should I call my blog?","I haven't used the computer in my basement since 1994 because the topless jpg. of Pamela Anderson is still downloading.","When you hold me, I'd prefer it not be \"accountable.\"","I went to a Mechanic when my car started making these awful noises but it just turned out to be Nickelback playing on the radio.","*becomes suddenly aware of the overwhelming amount of beauty and horror in the world and the brief second in time we exist on it* what the","I just remembered the fuck outta The Alamo.","I've never seen a dead body but I did once watch a girl get proposed to in an Applebee's","let us remember today the most important immigrant refugee in all of history. that's right i'm talking about waldo from where's waldo","The coolest thing about being a dog must be the ability to use your own ass for a pillow.","NYPD officers accidentally shot two tourists in Times Square, but in the cop’s defense, the tourists were about to eat at Olive Garden","Let them know how much you care. This holiday season, say it with a mass text.","Girls aren't friends with other girls. They are just future enemies.","God loves me even when I don't forward those chain letters","A fun thing to do when you're done dating someone is just disappear completely and pretend you've lost your phone and died","Friday Fun Fact: There's more time spent installing Adobe updates than the actual use of Adobe.","It's amazing that even 20 years later, pretending to shoot heroin with an mechanical pencil can still be a great way to procrastinate.","If I could go back to my childhood with the knowledge I have today, I'd probably earn the nickname 'little pervert'.","Whenever I hear an uninteresting 80 year old woman tell an uninteresting story I think, \"Wow, you must have been really hot.\"","I'm a hard core Trekkie except instead of Star Trek, alcohol.","HOLY SHIT I JUST CORRECTLY GUESSED A WIFI PASSWORD AM I JESUS?","Another Sunday at Gym Church w/ Pastor Pumpz. We sang \"My Bod is an Awesome Bod\", \"Bod is Great Bod is Good\", and \"Be Thou My Protein\"","Holy shit, FREE BANANAS at Walmart if you walk around eating them while you shop!","29 months? Yeah, no, I meant how old is your kid in HOURS.","my life is all about getting strong and powerful and then marching on down to hell to challenge satan for the throne","If at first you don't succeed tell yourself a litany of excuses then numb yourself with Oreo blizzards.","\"There's nothing more beautiful than the birth of a child.\" (someone who's never seen the birth of a child)","Kudos to therapists for resisting the natural urge to top other people's problems.","Commandment XI: There Shall Be No Boner Sound Other Than “Boioioioioioing”","my fitness goal is just to get down to the weight that i lied about on my drivers license","\"This is NPR.\" Yeah, we know. You just spent the past 4 minutes whispering the news over a jazz saxophone solo.","Walked in on the big pillow in bed with my favorite blanket. Feel so betrayed.","If you want something to be misinterpreted, post it on the Internet.","hey sory i just saw this mesage u sent last month even tho all my notifications make sounds and my phone is in my hand even when im sleeping","\"Nope. Nope. Yeah right. Nope. Close! Nah. Nope. Almost! Hahaha, you're terrible at this.\" - piece of popcorn stuck between teeth."]
