["Sitting with Grandma at the hospital. She noticed me checking my watch and said, \"Go on Dummy. I know brunch is almost over at the tit bar.\"","I hate it when I accidentally grab two pieces of pizza and then have to eat the whole thing to keep it even.","At my 16th birthday party, 1 guy came as a bunch of balloons, another as an untouched table of snacks & another came as an empty church hall","\"Naps ain't shit!\" -Comas","[Mary Magdalene, in bed with someone else after Jesus dies] Him: You said his name again.","Yesvember!","\"Are you from Cincinnati?\" \"No. Bosboston.\"","\"God hates fogs\" - homophobic clouds","TRUTH: cop teaches class on drug awareness \"honestly guys... pot isn't bad for you\" *class gives standing ovation* *cop starts breakdancing*","If you're gonna take the high road,wear a skirt. I need something to look at from the low road.","When I'm high, I'll call some customer service number and choose the Spanish option just for the challenge.","Snoop Dogg repackaged himself as Snoop Lion, and then went on to become Snoop Carrot, The first rapper who is also a raw carrot","According to my mom, Michael Jackson died again. #RIPPrince","I'm thankful for the Buffalo Soldiers who fought tirelessly for our chicken wings.","I like walking up to any bald guy wearing sunglasses and saying \"Excuse me but I'm supposed to meet a guy named Pitbull here, are you him?\"","I'm not ready for a child, I should have never banged that stork.","If the cat's got your tongue, it's your fault. What did you expect, making out with a cat?","Your Google search history is the real you.","I’ll never understand why news reporters think they have to stand out in the rain or snow just to tell us it’s raining or snowing.","Girls with long nails explain to me your life. Like, do you not touch things? Do you enjoy dirt?","After a few days without my phone, I've learned what's really important in life. My phone.","I don't care what your bio says. You retweet me, it's not only an endorsement, it represents the views of your employer.","I hope that one day I can be as proud about anything as my cat is about his asshole.","We attract people who are reflections of ourselves. So beware of anyone who wants to be with you when you're an emotional wreck.","Do you think Gillette employees ever call in Schick to work?","The fact that we're supposed to reuse a vagina after a mini human has crawled out of it kinda bums me out.","Hope Rod Stewart knows that Maggie May stopped listening to the song when he sang, \"The morning sun in your face really shows your age.\"","Next time you think you're weird think about how Walt Disney had a fetish for ducks and mice in high heels and shitload of mascara.","\"8. I have 8 condoms full of hummus taped to my person right now. Anyway, enough about me, can I get you folks started with an appetizer?\"","I ate one of those orange Hostess cupcakes and now I have to live in the sewers.","i hope the guy behind me in line doesn't think i'm a weird cat lady cause my cart's full of fancy feast. i just like the way it tastes, dude","I never wash my fruit, in case anybody's wondering how badass I am.","2015 twilight zone episode abt me wanting to get jacked so my clothes fit better but then I get so jacked they look too tight and weird","Today a three-year-old child who I've never met before told me to shut up, and I wasn't even talking.","Umlaut is a pretty fancy word for what are basically just little letter nipples.","I want a coffee so rich and bold it has a cabin in the woods where it hunts humans for sport.","I chug everything I drink just so people can't say I have a problem with alcohol. So you're telling me I have a problem with Pepsi too, mom?","If they grew up in the same house and shared a pet, siblings have the same porn name and I think that's just SICK.","I accidentally left the \"Shake to Shuffle\" feature of my iPod turned on during my run and listened to 2,379 songs in 4 miles.","Pro Tip: Make sure you're physically fit when arguing with a mime. They speak the language of the body.","The man at the grocery store name is Bobby Chubsucker. He was either very popular or made fun of a lot in school.","Everything's gonna be ok ma'am, I've got a degree from an online college.","My husband got a new router and the wifi has been off for 5 whole minutes guess I'll go churn butter or something.","I bought quick oats and two days later my roommate showed up with instant oats. I will not be humiliated; I must find an even sooner oat.","What I lack in social skills, I make up for in hiding-from-people skills.","My OCD requires me to slit the throats of people who sing Christmas songs to themselves out loud in quiet workplaces. The Cops understand.","when someone near me yawns i can't help but match the yawn with a visually similar scream","coining \"twoosh\", a contraction of tweet-swoosh. It's when your tweet hits exactly 140 characters sans editing. Nothing but net.","If you need me I'll always be stuck behind the person who doesn't know how to use the CVS self-checkout aisle.","Bad news: none of the fireworks at the Trump rally misfired and killed me!","Cooking tip: You can almost always substitute Nutella for a serious relationship.","I seriously thought the slang phrase 'This place is 'crackalackin!', actually meant 'This place is lacking white people'.","I was in a serious relationship once. We never even smiled.","My cat is my date and we got asked to leave the Olive Garden. Probably because she's black.","I hope there's a special place in Hell for me. I'd hate to be lumped in with all those other assholes.","Christopher Walken does one of the top seven Christopher Walken impressions I've ever heard.","*first day as almond milk factory worker* where the tiddies at","Tattoos are a nice way to forever honor loved ones, like family members who have passed away, or skulls with bat wings that have passed away","The Texas Rangers made it to the World Series? I didn't even know Chuck Norris had a baseball team.","My Great Great Great Grandfather Alex Would have turned 176 years old today. Please be aware of the dangers of Civil Wars.","Turns out I got Lazik surgery by mistake so now I have two lazy eyes.","[royalty free Black Keys-sounding music plays] Anthony Bourdain: There's nothing more rock n roll than eating a famous new york city whopper","Celebrities are called stars because they're hot, not very bright, unattainable and destined to eventually collapse into a black hole.","My Mexican waiter put my food down in front of another white lady who looked nothing like me. I get it now. Oh wait that's not my waiter.","My mom learning how to use twitter is like the raptors figuring out how to open doors in Jurassic Park.","Lost my job as an Old West saloon piano player when a mysterious stranger walked in the door and I just kept playing","\"I got hoes in different area codes.\" - World's most disorganized landscaper.","Probably one of the hardest things for Pinocchio to pull off was complimenting his friend's experimental theater piece.","Damn shame some of ya'll will get on twitter to say Goodmorning before even brushing your teeth. #mustymouthtweet","Thanks to the internet I know the actual medical terms for all the ailments that I'm positive I'm dying from.","According to old paintings, there's mad titties in heaven.","My daughter may only be one year old today, but she retrieves beer from the fridge at a fourth grade level.","[the boss walks by my desk and catches me looking at sonic anime] Me: the hackers are at it again. I was trying to visit church. com","A bee was buzzing around my head and I was all \"It's not worth it, bro\" and he was all \"Fuck you, let's dance.\" Stung me and he's dead.","PISSED: teen gets fed up with teacher \"can i use the bathroom?\" \"i don't know, CAN you?\" *takes deep breath* *pisses all over teachers desk*","Is anyone going to tell America's Funniest Home Videos about youtube?","\"I have another terrible idea for a movie!\" - Tyler Perry, every morning.","The office supplier gave us some cheap toilet paper and now we've got a real mess on our hands.","caught my dog smoking weed so I sent her to military school","If Jesus really loved me he would have died and resurrected himself a few more times to give me some extra public holidays.","NCAA Hockey needs to re-name brackets. How is Alaska in the NE? They can see Russia.","is it \"milfs\" or \"milves\"?","\"This town ain't big enough for the two of us.\" -Someone who is terrible at English, science, and geography.","I an expert on everything as long as I have google within reach and I don't like you enough to want to prove you wrong.","I'm eating for 4: me, Beyoncé, and the twins.","shoutout to social anxiety but very quietly and while no one is looking","North Korean civilians have been playing the Hunger Games since the 1950s.","When you ask if I want fries or salad, I’ll pretend it’s a tough choice and we’ll enjoy a genial laugh before you bring me more ketchup.","My favorite kinds of people are sandwiches.","Happy birthday Bob Marley. Shirts with your face on it are now sold at Walmart.","When you're checking for murderers in your house, don't just yell out \"hello!\" that gives them the upper hand. Yell, \"YOU AINT SHIT!\"","My parents are pretty middle aged. \"So? That's pretty norm-\" *two knights bust in* \"CHILD, DOST THOU REQUEST REFRESHMENTS FROM THE TAVERN?\"","Our son eats 3 bowls of generic fruity pebbles every morning then pukes on the bus.","Surprised to learn that famed pornography company American Apparel has entered the clothing business.","\"It says here you're very sarcastic?\" Actually it says sadistic “why would you put that on a resume?” I was being sarcastic","what if it doesnt want to be called hot sauce???? what if it wants to be called beautiful sauce","Men who shave their arms and legs probably shave their vaginas as well."]
